Revit 2027 API
BuiltInFailures.ImportFailures.ElementRenamedOnImport Property
 There were duplicate names between the active model and the imported element. To avoid duplicate names, the imported element has been renamed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementRenamedOnImport { get; }
Public Shared ReadOnly Property ElementRenamedOnImport As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementRenamedOnImport {
	FailureDefinitionId^ get ();
}
static member ElementRenamedOnImport : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace